app/views/drawings/show.html.erb

      <% end %>
        <% if Favorite.find_by(user: current_user, drawing: @drawing) %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" IS NULL AND "favorites"."drawing_id" = 25 LIMIT $1  [["LIMIT", 1]]


  <% if @drawing.notes.present? %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."drawing_id" = $1  [["drawing_id", 25]]