app/views/drawings/show.html.erb


  <% if @drawing.comments.present? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."drawing_id" = $1  [["drawing_id", 1]]