app/controllers/comments_controller.rb

SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Meggy"], ["body", "hey"], ["drawing_id", 3], ["created_at", 2016-08-01 12:47:05 UTC], ["updated_at", 2016-08-01 12:47:05 UTC]]
---
  def create
    @drawing = Drawing.find(params[:drawing_id])
    @comment = @drawing.comments.create(comment_params)

SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."drawing_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["drawing_id", 1], ["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]
---
def destroy
  @drawing = Drawing.find(params[:drawing_id])
  @comment = @drawing.comments.find(params[:id])
  @comment.destroy