app/controllers/drawings_controller.rb

  def index
    @drawings = Drawing.all
---
SELECT "drawings".* FROM "drawings"

  def show
    @drawing = Drawing.find(params[:id])
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @drawing = Drawing.find(params[:id])
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    puts params[:address].inspect
    @address = params[:address]
    @drawing = Drawing.new(drawing_params)

    if @drawing.save
---
INSERT INTO "drawings" ("title", "description", "location", "created_at", "updated_at", "drawing_image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Here you go"], ["description", ""], ["location", ""], ["created_at", 2016-08-07 17:19:10 UTC], ["updated_at", 2016-08-07 17:19:10 UTC], ["drawing_image", nil]]

  def update
    @drawing = Drawing.find(params[:id])

    if @drawing.update(drawing_params)
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "drawings" SET "title" = $1, "updated_at" = $2 WHERE "drawings"."id" = $3  [["title", "Drawing (the best one yet)"], ["updated_at", 2016-08-01 01:39:56 UTC], ["id", 1]]

  def destroy
    @drawing = Drawing.find(params[:id])
    @drawing.destroy
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "drawings" WHERE "drawings"."id" = $1  [["id", 2]]

  def add_favorite
    @drawing = Drawing.find(params[:id])
    @drawing.favorites.create(user: current_user)
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["drawing_id", 25], ["created_at", 2016-08-10 19:26:51 UTC], ["updated_at", 2016-08-10 19:26:51 UTC]]

  def remove_favorite
    @drawing = Drawing.find(params[:id])
    @drawing.favorites.where(user: current_user).destroy_all
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."drawing_id" = $1 AND "favorites"."user_id" IS NULL  [["drawing_id", 25]]