app/controllers/notes_controller.rb

  def new
    @drawing = Drawing.find(params[:drawing_id])
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def edit
    @drawing = Drawing.find(params[:drawing_id])
    @note = Note.find(params[:id])
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @drawing = Drawing.find(params[:drawing_id])
    @note = @drawing.notes.create(note_params)
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "notes" ("title", "body", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "HEllooo"], ["body", "Here's ya note!"], ["drawing_id", 4], ["created_at", 2016-08-05 19:56:10 UTC], ["updated_at", 2016-08-05 19:56:10 UTC]]